[
    {
        
        "blogTitle": "Tracker Network Changelog February 2024",
        "data": "March 01, 2024",
        "author": "Andrea Memoli",
        "headerImage": "https://imgsvc.trackercdn.com/url/size(1280x720),fit(cover),quality(100)/https%3a%2f%2ftrackercdn.com%2fghost%2fimages%2f2024%2f3%2f11248_article_trn-feb-24-update_1280x720.png/image.png",
        "content1": [
            {
                "title": "Highlights:",
                "paragraph": "We were excited to introduce a brand new, major feature on Fortnite Tracker. The Replays Viewer!"
            },
            {
                "title": "",
                "paragraph": "A brand new way of checking your Fortnite stats on a deeper level. Loadouts, full roster stats, performance and the works. There is a lot to cover with this one, so you can check more details about it here."
            },
            {
                "title": "",
                "paragraph": ""
                
            }
        ],
        "img1": "https://trackercdn.com/ghost/images/2024/3/11118_15139_image.png",
        "content2": [
            {
                "title": "Jungle Timers Feature Now Live on League Tracker App",
                "paragraph": "One of the most beloved and awaited features we received requests for is the Jungle Timers feature on the mini-map."
            },
            {
                "title": "",
                "paragraph": "Well, this month we released an update with that, among other improvements to make the app even better. It will also adapt to different sizes of the mini-map based on your preferences. Doesn't matter if you are a Jungler or ADC, you will always know when the next dragon comes next."
            },
            {
                "title": "",
                "paragraph": "Being on top of everything that happens in the match is now even better and easier with the Leaguer Tracker app." 
            },
            {
                "title": "",
                "paragraph": "Get more details and download our PC app for League of Legends here."
            }
        ],
        "img2": "https://trackercdn.com/ghost/images/2024/3/11122_image%20(39).png",
        "content3": [
            {
                "title": "Everything Else Across Tracker Network:",
                "paragraph": ""
            },
            {
                "title": "Web:",
                "paragraph": "[General] You can now click on nicknames in profiles to copy to clipboard. [General] Improved viewability of pages and dropdown mechanism on mobile web. [Destiny 2] Added \"Defeats\" stat to Leaderboards and profile. [Destiny 2] Improved the experience when navigating between certain pages. [BF2042] Fixed an issue with missing item names. [CS2] Fixed an issue with KAST Percentile. [League of Legends] Fixed a filtering issue when navigating between different tabs on profiles. [Valorant] Fixed an issue with France Premier leaderboard leading to US West leaderboard. [Valorant] Fixed a visual bug that caused some victories (by surrender) to appear as draws. [Fortnite] Added 2023 PR to Profile Events page widget. [Fortnite] Fixed an issue with \"Pro\" tags when searching for a player. [Fortnite] Fixed issue with Festival Leaderboards being frozen in their Season 1 state."
    
            },
            {
                "title": "",
                "paragraph": "" 
            }
        ],
        "img3": ""
        },
        {
        
            "blogTitle": "Who won the FNCS 2024 Major 1? A recap of the regional winners!",
            "data": "February 26, 2024",
            "author": "Andrea Memoli",
            "headerImage": "https://imgsvc.trackercdn.com/url/size(1280x720),fit(cover),quality(100)/https%3a%2f%2ftrackercdn.com%2fghost%2fimages%2f2024%2f2%2f261651_GHHzeDLXEAAaXXq.png/image.png",
            "content1": [
                {
                    "title": "",
                    "paragraph": "The FNCS Major 1 of 2024 has come to a close, marking another exhilarating chapter in the Fortnite competitive scene. With breathtaking play, intense battles and surprising results, the tournament showcased the extraordinary skill and talent of the world's top Fortnite players. From Europe to North America, Brazil to Asia, and Oceania to the Middle East, competitors from every corner of the globe left their mark on the battlefield, vying for glory and a coveted spot in the Global Championship."
                },
                {
                    "title": "",
                    "paragraph": "In this article, we'll take a closer look at the regional winners who emerged triumphant from this epic showdown. From the heart-stopping clashes in Europe to the fierce competition in North America and beyond, each region saw its champions rise to the occasion in spectacular fashion."
                },
                {
                    "title": "Europe",
                    "paragraph": "Europe is once again home to some of the best players around, with Malibuca and Merstach taking the top spot, just one point ahead of Queasy and Th0masHD. Third place goes to Kiro and Kiduoo with a stellar performance, followed by Sangild and Marius. Fifth place goes to Vico and Pinq. Top 7 for Vadeal and Rezon ay. Andilex & Seyyto make a solid comeback on day 2 to secure tenth place. Veno and TaySon finish the tournament in the top 15, while last year's winners Swizzy and Putrick finish in the top 21. Aqua, winner of the Duo World Cup alongside Noahreyli, finishes in the top 23. Setty and Kami settle for the top 33. Mongraal & MrSavage and K1ng & Fazer secure 40th and 41st place respectively."
                    
                }
            ],
            "img1": "https://pbs.twimg.com/media/GHPH-yZXEAAquoD?format=jpg&name=small",
            "content2": [
                {
                    "title": "Other Regions",
                    "paragraph": "The Fortnite competitive scene was alive and well in regions across the globe, with impressive performances from top duos in each area. In Brazil, the tournament was won by Cadu and Seeyun, who finished almost 100 points ahead of the runners-up. It's worth noting that the duo who finished first on day one, Phzin & Kitoz, were banned."
                },
                {
                    "title": "",
                    "paragraph": "In Asia, Zagou triumphed once again, this time alongside Shelom, a familiar face on the Asian scene. In Oceania, the winners are Suns and Vazen, 130 points ahead of the runners-up, Alex and Worthy."
                },
                {
                    "title": "",
                    "paragraph": "In the Middle East, the perennial winners Kalgamer and 7man, who are always prominent in every tournament, returned to triumph, followed by the immaculate 5aald and Hero." 
                }
            ],
            "img2": "https://pbs.twimg.com/media/GHORG3AXgAEL-kC?format=jpg&name=small",
            "content3": [
                {
                    "title": "",
                    "paragraph": "Overall, the level of competition on display in each region was a testament to the passion and dedication of Fortnite players around the world. With so much talent on display, it's clear that the future of the game is in good hands. Whether you're a fan of Fortnite e-sports or simply enjoy the thrill of high-stakes competition, there was plenty to enjoy in these regional tournaments."
                },
                {
                    "title": "",
                    "paragraph": "If you're interested in the stats and leaderboard information for Fortnite, then check out our official tracker page for the game! We also have a Fortnite Tracker App that can monitor your in-game performance. Consider checking us out and let us know on Twitter at @FortniteTracker what you'd like to see next!"
                },
                {
                    "title": "",
                    "paragraph": "" 
                }
            ],
            "img3": "https://pbs.twimg.com/media/GHORXrBWkAA3YNa?format=png&name=small"
        
    },
    {
        
        "blogTitle": "NFL Star Dexter Lawrence Joins Agent as Content Creator!",
        "data": "February 22, 2024",
        "author": "Andrea Memoli",
        "headerImage": "https://imgsvc.trackercdn.com/url/size(1280x720),fit(cover),quality(100)/https%3a%2f%2ftrackercdn.com%2fghost%2fimages%2f2024%2f2%2f211641_dexsmile.jpeg/image.png",
        "content1": [
            {
                "title": "",
                "paragraph": "NFL star Dexter Lawrence has joined forces with leading eSports organisation and lifestyle brand Agent in an exciting collaboration that underlines the growing influence of gaming in mainstream entertainment. Known for his prowess as a defensive tackle for the New York Giants, Lawrence brings his passion for gaming to the forefront as he joins forces with Agent, solidifying the company's position as a leader in the esports arena."
            },
            {
                "title": "",
                "paragraph": "The announcement, made on 22 February 2024 by Agent founder and CEO Conrad Thompson, signals a significant step in bridging the worlds of professional sports and esports. Thompson expressed his enthusiasm for Lawrence's addition to the Agent family, recognizing the NFL star's gaming fervor and the unique perspective he brings to the industry, particularly as a person of color."
            },
            {
                "title": "",
                "paragraph": "Since its inception in 2019, Agent has emerged as a premier lifestyle brand synonymous with competitive gaming, entertainment and stylish apparel. With Lawrence on board, the organisation aims to further strengthen its brand identity and expand its reach within the booming eSports market, which is valued at over $1 billion globally and continues to grow."
                
            },
            {
                "title": "",
                "paragraph": "Lawrence's role at Agent will encompass various facets of the organisation, from content creation to brand development. His involvement will not only raise Agent's profile, but also foster a connection between traditional sports and esports that will resonate with fans of both."
            }
        ],
        "img1": "https://trackercdn.com/ghost/images/2024/2/211642_dexyrad.jpeg",
        "content2": [
            {
                "title": "NFL",
                "paragraph": "For Lawrence, joining Agent is the realisation of a lifelong dream. With a love of gaming and a competitive spirit, he sees this opportunity as a way to bring new energy and excitement to the gaming landscape. Lawrence expressed his eagerness to be part of a dynamic and innovative organisation committed to pushing the boundaries of esports."
            },
            {
                "title": "",
                "paragraph": "Agent's recent successes, including representing the championship team at the 2023 Fortnite Champion Series in Copenhagen, coupled with Disney's significant investment in Epic Games, highlight the burgeoning potential of the esports industry. While Agent already boasts the support of Fortune 500 partners, Thompson remains open to new investors, citing Lawrence's expertise and creativity as valuable assets in attracting further investment."
            },
            {
                "title": "",
                "paragraph": "As Agent continues to chart its course in esports, Lawrence's partnership heralds a new chapter of growth and innovation. To learn more about Agent, its initiatives and upcoming endeavours, visit the official website at www.agentgaming.gg and follow the organisation on social media platforms including Twitter (@AgentGGs), Instagram (@Agent.ggs) and YouTube (@AgentGGs)." 
            }
        ],
        "img2": "",
        "content3": [
            {
                "title": "",
                "paragraph": ""
            },
            {
                "title": "",
                "paragraph": ""
            },
            {
                "title": "",
                "paragraph": "" 
            }
        ],
        "img3": ""
    },

    


    {
        
        "blogTitle": "The best STORYLINES from FNCS Major 1! (EU)",
        "data": "February 19, 2024",
        "author": "Andrea Memoli",
        "headerImage": "https://imgsvc.trackercdn.com/url/size(1280x720),fit(cover),quality(100)/https%3a%2f%2ftrackercdn.com%2fghost%2fimages%2f2024%2f2%2f191154_fncs-2024-tile-1920x1080-1920x1080-db9095afd171.jpg/image.jpg",
        "content1": [
            {
                "title": "",
                "paragraph": "We're now a week away from the first FNCS of 2024, the FNCS Major 1, which also serves as a qualifier for the FNCS Global Championship, the major event taking place at the end of the year."
            },
            {
                "title": "",
                "paragraph": "In this season, many players have switched partners, risking not being able to adapt to the changes in time. More than ever this season, there are many old names returning to compete in a final, making it one of the most hyped events in recent times, especially considering the numbers!"
            },
            {
                "title": "Mongraal returns and qualifies for another Grand Final after 1500 days!",
                "paragraph": "Mongraal, who has recently returned to playing Fortnite and has been grinding not only on the content side but also on the competitive side, along with another equally important figure in the global Fortnite scene, MrSavage, are finally achieving the long-awaited results. The duo narrowly missed out on qualifying in the upper bracket and had to put in a strong performance in the last chance round, where they managed to place in the top 15. This duo is literally driving the scene on social media, with a combined audience of 150,000 spectators at any one time during these qualifiers. Do you think this FNCS could see Mongraal and MrSavage at the top of the leaderboard?"
                
            },
            {
                "title": "Aqua qualifies for another Grand Final after 631 days!",
                "paragraph": "Aqua, one of the best and most influential players in Fortnite history, with one of the most remarkable and inspiring stories you've ever heard, has returned after a 2023 where he wasn't actively participating. Alongside his duo Noahreyli, they are putting on a show and have also managed to qualify for the FNCS Major 1 Finals. Expect a showdown between Aqua and Queasy in the high rounds of the first match!"
            }
        ],
        "img1": "https://pbs.twimg.com/media/GGpFwatWgAAfKxt?format=jpg&name=900x900",
        "content2": [
            {
                "title": "Fazer & K1ng qualify for their first-ever EU FNCS finals!",
                "paragraph": "After relocating from Brazil to Europe, k1ng and fazer have had moments of great performance alternating with disappointments in the various tournaments surrounding this FNCS. Nonetheless, the Brazilian duo managed to qualify for the finals during the last chance major, where they stood out. Despite the challenges of the region, much is expected from the duo, who are accustomed to winning, and doing so in great style."
            },
            {
                "title": "",
                "paragraph": ""
            },
            {
                "title": "",
                "paragraph": "" 
            }
        ],
        "img2": "https://pbs.twimg.com/media/GGp321oWAAA0Mb-?format=jpg&name=small",
        "content3": [
            {
                "title": "Swizzy & Putrick continue to play together and dominate after the title was taken away from them in the last edition!",
                "paragraph": "Swizzy and Putrick, the real winners of the last edition of the FNCS, the 2023 Major 3, have decided to continue playing together to try and reclaim the victory that they had to remove from their list of achievements. Swizzy and Putrick are two Russian players who currently reside in another country to compete. Swizzy has also won an FNCS in Asia, making him a popular player for this achievement as well. I hope they can get back to the top of the leaderboard, they really deserve it!"
            },
            {
                "title": "Hen is slowly coming back with his duo Vaske, hopefully, we'll soon see Hen in his prime like in 2021!",
                "paragraph": "Hen, one of the most popular English players of all time thanks to his glorious past with teams like Become Legends and Guild Esports, is slowly making his way back to the top of the leaderboards. He is still a long way from his prime back in between 2021 and 2022, but together with his duo Vaske, he can undoubtedly shine again, and we at FortniteTracker wish him all the best!"
            },
            {
                "title": "",
                "paragraph": "" 
            }
        ],
        "img3": ""
    },





    {
        
        "blogTitle": "Disney to take $1.5 Billion Stake in Epic Games!",
        "data": "February 08, 2024",
        "author": "Andrea Memoli",
        "headerImage": "https://imgsvc.trackercdn.com/url/size(1280x720),fit(cover),quality(100)/https%3a%2f%2ftrackercdn.com%2fghost%2fimages%2f2024%2f2%2f81312_GF0QOyCXIAAtF5N.jpg/image.jpg",
        "content1": [
            {
                "title": "",
                "paragraph": "In a groundbreaking move that will redefine the gaming landscape, two entertainment giants, Disney and Epic Games, have announced a monumental collaboration to create a vast and interconnected gaming and entertainment universe tied to the massively popular Fortnite platform. This strategic alliance will not only leverage the strengths of both companies, but also push the boundaries of immersive storytelling and interactive experiences to unprecedented heights."
            },
            {
                "title": "",
                "paragraph": "As part of this visionary partnership, The Walt Disney Company will invest a staggering $1.5 billion to acquire an equity stake in Epic Games, solidifying its commitment to a multi-year project that promises to captivate audiences worldwide. With regulatory approvals pending, the stage is set for an epic convergence of beloved Disney stories, including those from Pixar, Marvel, Star Wars, Avatar and more, within the dynamic realm of Fortnite."
            },
            {
                "title": "",
                "paragraph": "At the heart of this collaboration is the creation of a new persistent universe, meticulously crafted to offer players and fans an unparalleled fusion of gameplay, storytelling and engagement. Leveraging the power of Unreal Engine, the innovative platform that has driven Fortnite's success, this expansive ecosystem will allow players to immerse themselves in their favourite Disney worlds, create their own adventures, and connect with other fans in a seamless and interactive way."
                
            }
        ],
        "img1": "https://mms.businesswire.com/media/20201106005561/en/836793/5/FN_Social_Disney%2B_Social_1920x1080-FINAL.jpg",
        "content2": [
            {
                "title": "",
                "paragraph": "Robert A. Iger, Chief Executive Officer of The Walt Disney Company, expressed his enthusiasm for this transformative venture, calling it Disney's most significant foray into gaming to date. He highlighted the potential for growth and expansion, echoing the sentiments of both companies in their shared vision to revolutionise the gaming and entertainment landscape."
            },
            {
                "title": "",
                "paragraph": "Tim Sweeney, CEO and founder of Epic Games, underscored the importance of Disney's early belief in the potential synergy between their worlds and Fortnite. He highlighted the joint efforts to build an ecosystem that transcends boundaries, uniting the vibrant communities of Disney and Fortnite enthusiasts in a shared universe of limitless possibilities."
            },
            {
                "title": "",
                "paragraph": "The collaboration between Disney and Epic Games marks the culmination of a long-standing relationship characterised by numerous successful integrations and activations within Fortnite, including the recent Marvel Nexus War with Galactus, which attracted record-breaking concurrent players. In addition, Unreal Engine's integral role in powering Disney's diverse portfolio, from video games to film productions and theme park attractions, underscores the synergy and shared commitment to pushing the boundaries of entertainment." 
            },
            {
                "title": "",
                "paragraph": ""
            }
        ],
        "img2": "",
        "content3": [
            {
                "title": "",
                "paragraph": "With the exponential growth of the games industry, with more than 3 billion gamers worldwide seeking immersive experiences and creative outlets, Disney's strategic shift to a licensing business model has been remarkably successful. With numerous award-winning titles and billion-dollar franchises, Disney's games division continues to thrive and resonate with audiences around the world."
            },
            {
                "title": "",
                "paragraph": "Looking ahead, the partnership between Disney and Epic Games holds immense promise to redefine the gaming landscape and take storytelling to new heights of interactivity and engagement. As the digital frontier continues to evolve, fueled by technological advancements and shifting consumer preferences, this collaboration stands as a beacon of innovation and creativity that will shape the future of entertainment for generations to come."
    
            },
            {
                "title": "",
                "paragraph": "" 
            }
        ],
        "img3": ""
    }
]

