[
    {
        "title": "Who won the FNCS 2024 Major 1? A recap of the regional winners!",
        "headerImage": "https://imgsvc.trackercdn.com/url/size(1280x720),fit(cover),quality(100)/https%3a%2f%2ftrackercdn.com%2fghost%2fimages%2f2024%2f2%2f261651_GHHzeDLXEAAaXXq.png/image.png",
        "content": [
            "The FNCS Major 1 of 2024 has come to a close, marking another exhilarating chapter in the Fortnite competitive scene. With breathtaking play, intense battles and surprising results, the tournament showcased the extraordinary skill and talent of the world's top Fortnite players. From Europe to North America, Brazil to Asia, and Oceania to the Middle East, competitors from every corner of the globe left their mark on the battlefield, vying for glory and a coveted spot in the Global Championship.",
            "In this article, we'll take a closer look at the regional winners who emerged triumphant from this epic showdown. From the heart-stopping clashes in Europe to the fierce competition in North America and beyond, each region saw its champions rise to the occasion in spectacular fashion.",
            "Europe",
            "Europe is once again home to some of the best players around, with Malibuca and Merstach taking the top spot, just one point ahead of Queasy and Th0masHD. Third place goes to Kiro and Kiduoo with a stellar performance, followed by Sangild and Marius. Fifth place goes to Vico and Pinq. Top 7 for Vadeal and Rezon ay. Andilex & Seyyto make a solid comeback on day 2 to secure tenth place. Veno and TaySon finish the tournament in the top 15, while last year's winners Swizzy and Putrick finish in the top 21. Aqua, winner of the Duo World Cup alongside Noahreyli, finishes in the top 23. Setty and Kami settle for the top 33. Mongraal & MrSavage and K1ng & Fazer secure 40th and 41st place respectively.",
            "<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1ST FNCS GRANDS W BEST PLAYER <a href=\"https://twitter.com/Merstach?ref_src=twsrc%5Etfw\">@Merstach</a> ($170.000) 🏆<br><br>LETS FUCKING GOOOOOOOOOOOOOOOOOOOOOOOO <a href=\"https://t.co/MquN7e1zbZ\">pic.twitter.com/MquN7e1zbZ</a></p>&mdash; GXR Malibuca (@MalibucaFN) <a href=\"https://twitter.com/MalibucaFN/status/1761866606366392506?ref_src=twsrc%5Etfw\">February 25, 2024</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>"
            
        ],
        "data": "",
        "author": ""
    }
]